apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Raspberry Pi</vendor>
  <name>RP2040</name>
  <version>0.1</version>
  <description>Dual-core Arm Cortex-M0+ processor, flexible clock running up to 133 MHz\n
    264KB on-chip SRAM\n
    2 x UART, 2 x SPI controllers, 2 x I2C controllers, 16 x PWM channels\n
    1 x USB 1.1 controller and PHY, with host and device support\n
    8 x Programmable I/O (PIO) state machines for custom peripheral support\n
    Supported input power 1.8-5.5V DC\n
    Operating temperature -20C to +85C\n
    Drag-and-drop programming using mass storage over USB\n
    Low-power sleep and dormant modes\n
    Accurate on-chip clock\n
    Temperature sensor\n
    Accelerated integer and floating-point libraries on-chip</description>
  <licenseText>Copyright (c) 2020 Raspberry Pi (Trading) Ltd.\n
    \n
    SPDX-License-Identifier: BSD-3-Clause</licenseText>
  <cpu>
    <name>CM0PLUS</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
    <deviceNumInterrupts>26</deviceNumInterrupts>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>XIP_CTRL</name>
      <version>1</version>
      <description>QSPI flash execute-in-place block</description>
      <baseAddress>0x14000000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>XIP_IRQ</name>
        <value>6</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Cache control</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>POWER_DOWN</name>
              <description>When 1, the cache memories are powered down. They retain state,\n
                but can not be accessed. This reduces static power dissipation.\n
                Writing 1 to this bit forces CTRL_EN to 0, i.e. the cache cannot\n
                be enabled when powered down.\n
                Cache-as-SRAM accesses will produce a bus error response when\n
                the cache is powered down.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_BADWRITE</name>
              <description>When 1, writes to any alias other than 0x0 (caching, allocating)\n
                will produce a bus fault. When 0, these writes are silently ignored.\n
                In either case, writes to the 0x0 alias will deallocate on tag match,\n
                as usual.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>When 1, enable the cache. When the cache is disabled, all XIP accesses\n
                will go straight to the flash, without querying the cache. When enabled,\n
                cacheable XIP accesses will query the cache, and the flash will\n
                not be accessed if the tag matches and the valid bit is set.\n\n
                If the cache is enabled, cache-as-SRAM accesses have no effect on the\n
                cache data RAM, and will produce a bus error response.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLUSH</name>
          <description>Cache Flush control</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>Write 1 to flush the cache. This clears the tag memory, but\n
                the data memory retains its contents. (This means cache-as-SRAM\n
                contents is not affected by flush or reset.)\n
                Reading will hold the bus (stall the processor) until the flush\n
                completes. Alternatively STAT can be polled until completion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Cache Status</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>FIFO_FULL</name>
              <description>When 1, indicates the XIP streaming FIFO is completely full.\n
                The streaming FIFO is 2 entries deep, so the full and empty\n
                flag allow its level to be ascertained.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>When 1, indicates the XIP streaming FIFO is completely empty.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FLUSH_READY</name>
              <description>Reads as 0 while a cache flush is in progress, and 1 otherwise.\n
                The cache is flushed whenever the XIP block is reset, and also\n
                when requested via the FLUSH register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR_HIT</name>
          <description>Cache Hit counter\n
            A 32 bit saturating counter that increments upon each cache hit,\n
            i.e. when an XIP access is serviced directly from cached data.\n
            Write any value to clear.</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <register>
          <name>CTR_ACC</name>
          <description>Cache Access counter\n
            A 32 bit saturating counter that increments upon each XIP access,\n
            whether the cache is hit or not. This includes noncacheable accesses.\n
            Write any value to clear.</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
        </register>
        <register>
          <name>STREAM_ADDR</name>
          <description>FIFO stream address</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STREAM_ADDR</name>
              <description>The address of the next word to be streamed from flash to the streaming FIFO.\n
                Increments automatically after each flash access.\n
                Write the initial access address here before starting a streaming read.</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_CTR</name>
          <description>FIFO stream control</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STREAM_CTR</name>
              <description>Write a nonzero value to start a streaming read. This will then\n
                progress in the background, using flash idle cycles to transfer\n
                a linear data block from flash to the streaming FIFO.\n
                Decrements automatically (1 at a time) as the stream\n
                progresses, and halts on reaching 0.\n
                Write 0 to halt an in-progress stream, and discard any in-flight\n
                read, so that a new stream can immediately be started (after\n
                draining the FIFO and reinitialising STREAM_ADDR)</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_FIFO</name>
          <description>FIFO stream data\n
            Streamed data is buffered here, for retrieval by the system DMA.\n
            This FIFO can also be accessed via the XIP_AUX slave, to avoid exposing\n
            the DMA to bus stalls caused by other XIP traffic.</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
