apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PLL_SYS</name>
      <version>1</version>
      <baseAddress>0x40028000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CS</name>
          <description>Control and Status\n
            GENERAL CONSTRAINTS:\n
            Reference clock frequency min=5MHz, max=800MHz\n
            Feedback divider min=16, max=320\n
            VCO frequency min=750MHz, max=1600MHz</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>PLL is locked</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Passes the reference clock to the output instead of the divided VCO. The VCO continues to run so the user can switch between the reference clock and the divided VCO but the output will glitch when doing so.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFDIV</name>
              <description>Divides the PLL input reference clock.\n
                Behaviour is undefined for div=0.\n
                PLL output will be unpredictable during refdiv changes, wait for lock=1 before using it.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR</name>
          <description>Controls the PLL power modes.</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x0000002D</resetValue>
          <fields>
            <field>
              <name>VCOPD</name>
              <description>PLL VCO powerdown\n
                To save power set high when PLL output not required or bypass=1.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTDIVPD</name>
              <description>PLL post divider powerdown\n
                To save power set high when PLL output not required or bypass=1.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSMPD</name>
              <description>PLL DSM powerdown\n
                Nothing is achieved by setting this low.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PD</name>
              <description>PLL powerdown\n
                To save power set high when PLL output not required.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBDIV_INT</name>
          <description>Feedback divisor\n
            (note: this PLL does not support fractional division)</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBDIV_INT</name>
              <description>see ctrl reg description for constraints</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIM</name>
          <description>Controls the PLL post dividers for the primary output\n
            (note: this PLL does not have a secondary output)\n
            the primary output is driven from VCO divided by postdiv1*postdiv2</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00077000</resetValue>
          <fields>
            <field>
              <name>POSTDIV1</name>
              <description>divide by 1-7</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTDIV2</name>
              <description>divide by 1-7</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PLL_SYS">
      <name>PLL_USB</name>
      <baseAddress>0x4002C000</baseAddress>
    </peripheral>
    <peripheral>
      <name>BUSCTRL</name>
      <version>1</version>
      <description>Register block for busfabric control signals and performance counters</description>
      <baseAddress>0x40030000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BUS_PRIORITY</name>
          <description>Set the priority of each master for bus arbitration.</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_W</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_R</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC1</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC0</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_PRIORITY_ACK</name>
          <description>Bus priority acknowledge</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUS_PRIORITY_ACK</name>
              <description>Goes to 1 once all arbiters have registered the new global priority levels.\n
                Arbiters update their local priority when servicing a new nonsequential access.\n
                In normal circumstances this will happen almost immediately.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR0</name>
          <description>Bus fabric performance counter 0</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR0</name>
              <description>Busfabric saturating performance counter 0\n
                Count some event signal from the busfabric arbiters.\n
                Write any value to clear. Select an event to count using PERFSEL0</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFSEL0</name>
          <description>Bus fabric performance event select for PERFCTR0</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>PERFSEL0</name>
              <description>Select an event for PERFCTR0. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>apb_contested</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_contested</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_contested</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_contested</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_contested</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_contested</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_contested</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_contested</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main_contested</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_contested</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom</name>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR1</name>
          <description>Bus fabric performance counter 1</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR1</name>
              <description>Busfabric saturating performance counter 1\n
                Count some event signal from the busfabric arbiters.\n
                Write any value to clear. Select an event to count using PERFSEL1</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFSEL1</name>
          <description>Bus fabric performance event select for PERFCTR1</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>PERFSEL1</name>
              <description>Select an event for PERFCTR1. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>apb_contested</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_contested</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_contested</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_contested</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_contested</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_contested</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_contested</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_contested</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main_contested</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_contested</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom</name>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR2</name>
          <description>Bus fabric performance counter 2</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR2</name>
              <description>Busfabric saturating performance counter 2\n
                Count some event signal from the busfabric arbiters.\n
                Write any value to clear. Select an event to count using PERFSEL2</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFSEL2</name>
          <description>Bus fabric performance event select for PERFCTR2</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>PERFSEL2</name>
              <description>Select an event for PERFCTR2. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>apb_contested</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_contested</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_contested</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_contested</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_contested</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_contested</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_contested</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_contested</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main_contested</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_contested</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom</name>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR3</name>
          <description>Bus fabric performance counter 3</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR3</name>
              <description>Busfabric saturating performance counter 3\n
                Count some event signal from the busfabric arbiters.\n
                Write any value to clear. Select an event to count using PERFSEL3</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
