apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM</name>
      <version>1</version>
      <description>Simple PWM</description>
      <baseAddress>0x40050000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWM_IRQ_WRAP</name>
        <value>4</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing CH*_CC, CH*_CSR, CH*_CTR, CH*_DIV, CH*_TOP</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CC</name>
            <description>Counter compare values</description>
            <addressOffset>0xC</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>B</name>
                <bitRange>[31:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>A</name>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CSR</name>
            <description>Control and status register</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PH_ADV</name>
                <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>clear</modifiedWriteValues>
              </field>
              <field>
                <name>PH_RET</name>
                <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>clear</modifiedWriteValues>
              </field>
              <field>
                <name>DIVMODE</name>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>div</name>
                    <description>Free-running counting at rate dictated by fractional divider</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>level</name>
                    <description>Fractional divider operation is gated by the PWM B pin.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>rise</name>
                    <description>Counter advances with each rising edge of the PWM B pin.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>fall</name>
                    <description>Counter advances with each falling edge of the PWM B pin.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>B_INV</name>
                <description>Invert output B</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>A_INV</name>
                <description>Invert output A</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PH_CORRECT</name>
                <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the PWM channel.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTR</name>
            <description>Direct access to the PWM counter</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CTR</name>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIV</name>
            <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
            <addressOffset>0x4</addressOffset>
            <resetValue>0x00000010</resetValue>
            <fields>
              <field>
                <name>INT</name>
                <bitRange>[11:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRAC</name>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TOP</name>
            <description>Counter wrap value</description>
            <addressOffset>0x10</addressOffset>
            <resetValue>0x0000FFFF</resetValue>
            <fields>
              <field>
                <name>TOP</name>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>EN</name>
          <description>This register aliases the CSR_EN bits for all channels.\n
            Writing to this register allows multiple channels to be enabled\n
            or disabled simultaneously, so they can run in perfect sync.\n
            For each channel, there is only one physical EN register bit,\n
            which can be accessed through here or CHx_CSR.</description>
          <addressOffset>0xA0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0xA4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0xA8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <description>Interrupt Force</description>
          <addressOffset>0xAC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS</name>
          <description>Interrupt status after masking &amp; forcing</description>
          <addressOffset>0xB0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
