apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ROSC</name>
      <version>1</version>
      <baseAddress>0x40060000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Ring Oscillator control</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000AA0</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>On power-up this field is initialised to ENABLE\n
                The system clock must be switched to another source before setting this field to DISABLE otherwise the chip will lock up\n
                The 12-bit code is intended to give some protection against accidental writes. An invalid setting will enable the oscillator.</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>3358</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <value>4011</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQ_RANGE</name>
              <description>Controls the number of delay stages in the ROSC ring\n
                LOW uses stages 0 to 7\n
                MEDIUM uses stages 0 to 5\n
                HIGH uses stages 0 to 3\n
                TOOHIGH uses stages 0 to 1 and should not be used because its frequency exceeds design specifications\n
                The clock output will not glitch when changing the range up one step at a time\n
                The clock output will glitch when changing the range down\n
                Note: the values here are gray coded which is why HIGH comes before TOOHIGH</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>4004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <value>4005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>4007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOOHIGH</name>
                  <value>4006</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQA</name>
          <description>The FREQA &amp; FREQB registers control the frequency by controlling the drive strength of each stage\n
            The drive strength has 4 levels determined by the number of bits set\n
            Increasing the number of bits set increases the drive strength and increases the oscillation frequency\n
            0 bits set is the default drive strength\n
            1 bit set doubles the drive strength\n
            2 bits set triples drive strength\n
            3 bits set quadruples drive strength</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PASSWD</name>
              <description>Set to 0x9696 to apply the settings\n
                Any other value in this field will set all drive strengths to 0</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <value>38550</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DS3</name>
              <description>Stage 3 drive strength</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DS2</name>
              <description>Stage 2 drive strength</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DS1</name>
              <description>Stage 1 drive strength</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DS0</name>
              <description>Stage 0 drive strength</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQB</name>
          <description>For a detailed description see freqa register</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PASSWD</name>
              <description>Set to 0x9696 to apply the settings\n
                Any other value in this field will set all drive strengths to 0</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <value>38550</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DS7</name>
              <description>Stage 7 drive strength</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DS6</name>
              <description>Stage 6 drive strength</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DS5</name>
              <description>Stage 5 drive strength</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DS4</name>
              <description>Stage 4 drive strength</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DORMANT</name>
          <description>Ring Oscillator pause control\n
            This is used to save power by pausing the ROSC\n
            On power-up this field is initialised to WAKE\n
            An invalid write will also select WAKE\n
            Warning: setup the irq before selecting dormant mode</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>DIV</name>
          <description>Controls the output divider</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>set to 0xaa0 + div where\n
                div = 0 divides by 32\n
                div = 1-31 divides by div\n
                any other value sets div=31\n
                this register resets to div=16</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <value>2720</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE</name>
          <description>Controls the phase shifted output</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>PASSWD</name>
              <description>set to 0xaa\n
                any other value enables the output with shift=0</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>enable the phase-shifted output\n
                this can be changed on-the-fly</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLIP</name>
              <description>invert the phase-shifted output\n
                this is ignored when div=1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHIFT</name>
              <description>phase shift the phase-shifted output by SHIFT input clocks\n
                this can be changed on-the-fly\n
                must be set to 0 before setting div=1</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDOMBIT</name>
          <description>This just reads the state of the oscillator output so randomness is compromised if the ring oscillator is stopped or run at a harmonic of the bus frequency</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RANDOMBIT</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Ring Oscillator Status</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STABLE</name>
              <description>Oscillator is running and stable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIV_RUNNING</name>
              <description>post-divider is running
 this resets to 0 but transitions to 1 during chip startup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Oscillator is enabled but not necessarily running and stable
 this resets to 0 but transitions to 1 during chip startup</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
