apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VREG_AND_CHIP_RESET</name>
      <version>1</version>
      <description>control and status for on-chip voltage regulator and chip level reset subsystem</description>
      <baseAddress>0x40064000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VREG</name>
          <description>Voltage regulator control and status</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>ROK</name>
              <description>regulation status\n
                0=not in regulation, 1=in regulation</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VSEL</name>
              <description>Output voltage select for on-chip voltage regulator.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <name>VSEL</name>
                <enumeratedValue>
                  <name>Voltage0_80</name>
                  <description>0.80V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage0_85</name>
                  <description>0.85V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage0_90</name>
                  <description>0.90V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage0_95</name>
                  <description>0.95V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_00</name>
                  <description>1.00V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_05</name>
                  <description>1.05V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_10</name>
                  <description>1.10V (default)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_15</name>
                  <description>1.15V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_20</name>
                  <description>1.20V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_25</name>
                  <description>1.25V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Voltage1_30</name>
                  <description>1.30V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIZ</name>
              <description>high impedance mode select\n
                0=not in high impedance mode, 1=in high impedance mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>enable\n
                0=not enabled, 1=enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD</name>
          <description>brown-out detection control</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000091</resetValue>
          <fields>
            <field>
              <name>VSEL</name>
              <description>threshold select\n
                0000 - 0.473V\n
                0001 - 0.516V\n
                0010 - 0.559V\n
                0011 - 0.602V\n
                0100 - 0.645V\n
                0101 - 0.688V\n
                0110 - 0.731V\n
                0111 - 0.774V\n
                1000 - 0.817V\n
                1001 - 0.860V (default)\n
                1010 - 0.903V\n
                1011 - 0.946V\n
                1100 - 0.989V\n
                1101 - 1.032V\n
                1110 - 1.075V\n
                1111 - 1.118V</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>enable\n
                0=not enabled, 1=enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_RESET</name>
          <description>Chip reset control and status</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSM_RESTART_FLAG</name>
              <description>This is set by psm_restart from the debugger.\n
                Its purpose is to branch bootcode to a safe mode when the debugger has issued a psm_restart in order to recover from a boot lock-up.\n
                In the safe mode the debugger can repair the boot code, clear this flag then reboot the processor.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>HAD_PSM_RESTART</name>
              <description>Last reset was from the debug port</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HAD_RUN</name>
              <description>Last reset was from the RUN pin</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HAD_POR</name>
              <description>Last reset was from the power-on reset or brown-out detection blocks</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
