apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PIO0</name>
      <version>1</version>
      <description>Programmable IO block</description>
      <baseAddress>0x50200000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PIO0_IRQ_0</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>PIO0_IRQ_1</name>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>PIO control register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV_RESTART</name>
              <description>Restart a state machine's clock divider from an initial phase of 0. Clock dividers are free-running, so once started, their output (including fractional jitter) is completely determined by the integer/fractional divisor configured in SMx_CLKDIV. This means that, if multiple clock dividers with the same divisor are restarted simultaneously, by writing multiple 1 bits to this field, the execution clocks of those state machines will run in precise lockstep.\n\n
                Note that setting/clearing SM_ENABLE does not stop the clock divider from running, so once multiple state machines' clocks are synchronised, it is safe to disable/reenable a state machine, whilst keeping the clock dividers in sync.\n\n
                Note also that CLKDIV_RESTART can be written to whilst the state machine is running, and this is useful to resynchronise clock dividers after the divisors (SMx_CLKDIV) have been changed on-the-fly.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>SM_RESTART</name>
              <description>Write 1 to instantly clear internal SM state which may be otherwise difficult to access and will affect future execution.\n\n
                Specifically, the following are cleared: input and output shift counters; the contents of the input shift register; the delay counter; the waiting-on-IRQ state; any stalled instruction written to SMx_INSTR or run by OUT/MOV EXEC; any pin write left asserted due to OUT_STICKY.\n\n
                The program counter, the contents of the output shift register and the X/Y scratch registers are not affected.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>SM_ENABLE</name>
              <description>Enable/disable each of the four state machines by writing 1/0 to each of these four bits. When disabled, a state machine will cease executing instructions, except those written directly to SMx_INSTR by the system. Multiple bits can be set/cleared at once to run/halt multiple state machines simultaneously.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTAT</name>
          <description>FIFO status register</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x0F000F00</resetValue>
          <fields>
            <field>
              <name>TXEMPTY</name>
              <description>State machine TX FIFO is empty</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFULL</name>
              <description>State machine TX FIFO is full</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXEMPTY</name>
              <description>State machine RX FIFO is empty</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>State machine RX FIFO is full</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDEBUG</name>
          <description>FIFO debug register</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXSTALL</name>
              <description>State machine has stalled on empty TX FIFO during a blocking PULL, or an OUT with autopull enabled. Write 1 to clear.</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TXOVER</name>
              <description>TX FIFO overflow (i.e. write-on-full by the system) has occurred. Write 1 to clear. Note that write-on-full does not alter the state or contents of the FIFO in any way, but the data that the system attempted to write is dropped, so if this flag is set, your software has quite likely dropped some data on the floor.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXUNDER</name>
              <description>RX FIFO underflow (i.e. read-on-empty by the system) has occurred. Write 1 to clear. Note that read-on-empty does not perturb the state of the FIFO in any way, but the data returned by reading from an empty FIFO is undefined, so this flag generally only becomes set due to some kind of software error.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXSTALL</name>
              <description>State machine has stalled on full RX FIFO during a blocking PUSH, or an IN with autopush enabled. This flag is also set when a nonblocking PUSH to a full FIFO took place, in which case the state machine has dropped data. Write 1 to clear.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEVEL</name>
          <description>FIFO levels</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX3</name>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX3</name>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX2</name>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX2</name>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX1</name>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX1</name>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RX0</name>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TX0</name>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TXF%s</name>
          <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
          <addressOffset>0x10</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>RXF%s</name>
          <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
          <addressOffset>0x20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>IRQ</name>
          <description>State machine IRQ flags register. Write 1 to clear. There are 8 state machine IRQ flags, which can be set, cleared, and waited on by the state machines. There's no fixed association between flags and state machines -- any state machine can use any flag.\n\n
            Any of the 8 flags can be used for timing synchronisation between state machines, using IRQ and WAIT instructions. The lower four of these flags are also routed out to system-level interrupt requests, alongside FIFO status interrupts -- see e.g. IRQ0_INTE.</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQ</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_FORCE</name>
          <description>Writing a 1 to each of these bits will forcibly assert the corresponding IRQ. Note this is different to the INTF register: writing here affects PIO internal state. INTF just asserts the processor-facing IRQ signal for testing ISRs, and is not visible to the state machines.</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQ_FORCE</name>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUT_SYNC_BYPASS</name>
          <description>There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities. This increases input delay, and for fast synchronous IO (e.g. SPI) these synchronizers may need to be bypassed. Each bit in this register corresponds to one GPIO.\n
            0 -&gt; input is synchronized (default)\n
            1 -&gt; synchronizer is bypassed\n
            If in doubt, leave this register as all zeroes.</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>DBG_PADOUT</name>
          <description>Read to sample the pad output values PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>DBG_PADOE</name>
          <description>Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>DBG_CFGINFO</name>
          <description>The PIO hardware has some free parameters that may vary between chip products.\n
            These should be provided in the chip datasheet, but are also exposed here.</description>
          <addressOffset>0x44</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IMEM_SIZE</name>
              <description>The size of the instruction memory, measured in units of one instruction</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SM_COUNT</name>
              <description>The number of state machines this PIO instance is equipped with.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_DEPTH</name>
              <description>The depth of the state machine TX/RX FIFOs, measured in words.\n
                Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double\n
                this depth.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-31</dimIndex>
          <name>INSTR_MEM%s</name>
          <description>Write-only access to instruction memory location %s</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSTR_MEM0</name>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x18</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>SM%s</name>
          <description>Cluster SM%s, containing SM*_CLKDIV, SM*_EXECCTRL, SM*_SHIFTCTRL, SM*_ADDR, SM*_INSTR, SM*_PINCTRL</description>
          <addressOffset>0xC8</addressOffset>
          <register>
            <name>SM_CLKDIV</name>
            <description>Clock divisor register for state machine 0\n
            Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x00010000</resetValue>
            <fields>
              <field>
                <name>INT</name>
                <description>Effective frequency is sysclk/(int + frac/256).\n
                Value of 0 is interpreted as 65536. If INT is 0, FRAC must also be 0.</description>
                <bitRange>[31:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FRAC</name>
                <description>Fractional part of clock divisor</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SM_EXECCTRL</name>
            <description>Execution/behavioural settings for state machine 0</description>
            <addressOffset>0x4</addressOffset>
            <resetValue>0x0001F000</resetValue>
            <fields>
              <field>
                <name>EXEC_STALLED</name>
                <description>If 1, an instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear to 0 once this instruction completes.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SIDE_EN</name>
                <description>If 1, the MSB of the Delay/Side-set instruction field is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction, but the maximum possible side-set width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUNT is inclusive of this enable bit.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SIDE_PINDIR</name>
                <description>If 1, side-set data is asserted to pin directions, instead of pin values</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>JMP_PIN</name>
                <description>The GPIO number to use as condition for JMP PIN. Unaffected by input mapping.</description>
                <bitRange>[28:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EN_SEL</name>
                <description>Which data bit to use for inline OUT enable</description>
                <bitRange>[23:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINE_OUT_EN</name>
                <description>If 1, use a bit of OUT data as an auxiliary write enable\n
                When used in conjunction with OUT_STICKY, writes with an enable of 0 will\n
                deassert the latest pin write. This can create useful masking/override behaviour\n
                due to the priority ordering of state machine pin writes (SM0 &lt; SM1 &lt; ...)</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_STICKY</name>
                <description>Continuously assert the most recent OUT/SET to the pins</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WRAP_TOP</name>
                <description>After reaching this address, execution is wrapped to wrap_bottom.\n
                If the instruction is a jump, and the jump condition is true, the jump takes priority.</description>
                <bitRange>[16:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WRAP_BOTTOM</name>
                <description>After reaching wrap_top, execution is wrapped to this address.</description>
                <bitRange>[11:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>STATUS_SEL</name>
                <description>Comparison used for the MOV x, STATUS instruction.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TXLEVEL</name>
                    <description>All-ones if TX FIFO level &lt; N, otherwise all-zeroes</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RXLEVEL</name>
                    <description>All-ones if RX FIFO level &lt; N, otherwise all-zeroes</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STATUS_N</name>
                <description>Comparison level for the MOV x, STATUS instruction</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SM_SHIFTCTRL</name>
            <description>Control behaviour of the input/output shift registers for state machine 0</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0x000C0000</resetValue>
            <fields>
              <field>
                <name>FJOIN_RX</name>
                <description>When 1, RX FIFO steals the TX FIFO's storage, and becomes twice as deep.\n
                TX FIFO is disabled as a result (always reads as both full and empty).\n
                FIFOs are flushed when this bit is changed.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FJOIN_TX</name>
                <description>When 1, TX FIFO steals the RX FIFO's storage, and becomes twice as deep.\n
                RX FIFO is disabled as a result (always reads as both full and empty).\n
                FIFOs are flushed when this bit is changed.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PULL_THRESH</name>
                <description>Number of bits shifted out of OSR before autopull, or conditional pull (PULL IFEMPTY), will take place.\n
                Write 0 for value of 32.</description>
                <bitRange>[29:25]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PUSH_THRESH</name>
                <description>Number of bits shifted into ISR before autopush, or conditional push (PUSH IFFULL), will take place.\n
                Write 0 for value of 32.</description>
                <bitRange>[24:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_SHIFTDIR</name>
                <description>1 = shift out of output shift register to right. 0 = to left.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_SHIFTDIR</name>
                <description>1 = shift input shift register to right (data enters from left). 0 = to left.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTOPULL</name>
                <description>Pull automatically when the output shift register is emptied, i.e. on or following an OUT instruction which causes the output shift counter to reach or exceed PULL_THRESH.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTOPUSH</name>
                <description>Push automatically when the input shift register is filled, i.e. on an IN instruction which causes the input shift counter to reach or exceed PUSH_THRESH.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
