apple/swift-embedded-examples/Tools/SVDs/rp2040.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PPB</name>
      <version>1</version>
      <baseAddress>0xE0000000</baseAddress>
      <size>0x20</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYST_CSR</name>
          <description>Use the SysTick Control and Status Register to enable the SysTick features.</description>
          <addressOffset>0xE010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNTFLAG</name>
              <description>Returns 1 if timer counted to 0 since last time this was read. Clears on read by application or debugger.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKSOURCE</name>
              <description>SysTick clock source. Always reads as one if SYST_CALIB reports NOREF.\n
                Selects the SysTick timer clock source:\n
                0 = External reference clock.\n
                1 = Processor clock.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TICKINT</name>
              <description>Enables SysTick exception request:\n
                0 = Counting down to zero does not assert the SysTick exception request.\n
                1 = Counting down to zero to asserts the SysTick exception request.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable SysTick counter:\n
                0 = Counter disabled.\n
                1 = Counter enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_RVR</name>
          <description>Use the SysTick Reload Value Register to specify the start value to load into the current value register when the counter reaches 0. It can be any value between 0 and 0x00FFFFFF. A start value of 0 is possible, but has no effect because the SysTick interrupt and COUNTFLAG are activated when counting from 1 to 0. The reset value of this register is UNKNOWN.\n
            To generate a multi-shot timer with a period of N processor clock cycles, use a RELOAD value of N-1. For example, if the SysTick interrupt is required every 100 clock pulses, set RELOAD to 99.</description>
          <addressOffset>0xE014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>Value to load into the SysTick Current Value Register when the counter reaches 0.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CVR</name>
          <description>Use the SysTick Current Value Register to find the current value in the register. The reset value of this register is UNKNOWN.</description>
          <addressOffset>0xE018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRENT</name>
              <description>Reads return the current value of the SysTick counter. This register is write-clear. Writing to it with any value clears the register to 0. Clearing this register also clears the COUNTFLAG bit of the SysTick Control and Status Register.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CALIB</name>
          <description>Use the SysTick Calibration Value Register to enable software to scale to any required speed using divide and multiply.</description>
          <addressOffset>0xE01C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NOREF</name>
              <description>If reads as 1, the Reference clock is not provided - the CLKSOURCE bit of the SysTick Control and Status register will be forced to 1 and cannot be cleared to 0.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>If reads as 1, the calibration value for 10ms is inexact (due to clock frequency).</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TENMS</name>
              <description>An optional Reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If the value reads as 0, the calibration value is not known.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ISER</name>
          <description>Use the Interrupt Set-Enable Register to enable interrupts and determine which interrupts are currently enabled.\n
            If a pending interrupt is enabled, the NVIC activates the interrupt based on its priority. If an interrupt is not enabled, asserting its interrupt signal changes the interrupt state to pending, but the NVIC never activates the interrupt, regardless of its priority.</description>
          <addressOffset>0xE100</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set-enable bits.\n
                Write:\n
                0 = No effect.\n
                1 = Enable interrupt.\n
                Read:\n
                0 = Interrupt disabled.\n
                1 = Interrupt enabled.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICER</name>
          <description>Use the Interrupt Clear-Enable Registers to disable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>0xE180</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits.\n
                Write:\n
                0 = No effect.\n
                1 = Disable interrupt.\n
                Read:\n
                0 = Interrupt disabled.\n
                1 = Interrupt enabled.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ISPR</name>
          <description>The NVIC_ISPR forces interrupts into the pending state, and shows which interrupts are pending.</description>
          <addressOffset>0xE200</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits.\n
                Write:\n
                0 = No effect.\n
                1 = Changes interrupt state to pending.\n
                Read:\n
                0 = Interrupt is not pending.\n
                1 = Interrupt is pending.\n
                Note: Writing 1 to the NVIC_ISPR bit corresponding to:\n
                An interrupt that is pending has no effect.\n
                A disabled interrupt sets the state of that interrupt to pending.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICPR</name>
          <description>Use the Interrupt Clear-Pending Register to clear pending interrupts and determine which interrupts are currently pending.</description>
          <addressOffset>0xE280</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits.\n
                Write:\n
                0 = No effect.\n
                1 = Removes pending state and interrupt.\n
                Read:\n
                0 = Interrupt is not pending.\n
                1 = Interrupt is pending.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR0</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.\n
            Note: Writing 1 to an NVIC_ICPR bit does not affect the active state of the corresponding interrupt.\n
            These registers are only word-accessible</description>
          <addressOffset>0xE400</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_3</name>
              <description>Priority of interrupt 3</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_2</name>
              <description>Priority of interrupt 2</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_1</name>
              <description>Priority of interrupt 1</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_0</name>
              <description>Priority of interrupt 0</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR1</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE404</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_7</name>
              <description>Priority of interrupt 7</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_6</name>
              <description>Priority of interrupt 6</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_5</name>
              <description>Priority of interrupt 5</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_4</name>
              <description>Priority of interrupt 4</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR2</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE408</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_11</name>
              <description>Priority of interrupt 11</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_10</name>
              <description>Priority of interrupt 10</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_9</name>
              <description>Priority of interrupt 9</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_8</name>
              <description>Priority of interrupt 8</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR3</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE40C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_15</name>
              <description>Priority of interrupt 15</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_14</name>
              <description>Priority of interrupt 14</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_13</name>
              <description>Priority of interrupt 13</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_12</name>
              <description>Priority of interrupt 12</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR4</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE410</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_19</name>
              <description>Priority of interrupt 19</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_18</name>
              <description>Priority of interrupt 18</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_17</name>
              <description>Priority of interrupt 17</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_16</name>
              <description>Priority of interrupt 16</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR5</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE414</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_23</name>
              <description>Priority of interrupt 23</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_22</name>
              <description>Priority of interrupt 22</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_21</name>
              <description>Priority of interrupt 21</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_20</name>
              <description>Priority of interrupt 20</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR6</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE418</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_27</name>
              <description>Priority of interrupt 27</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_26</name>
              <description>Priority of interrupt 26</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_25</name>
              <description>Priority of interrupt 25</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_24</name>
              <description>Priority of interrupt 24</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR7</name>
          <description>Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest.</description>
          <addressOffset>0xE41C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IP_31</name>
              <description>Priority of interrupt 31</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_30</name>
              <description>Priority of interrupt 30</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_29</name>
              <description>Priority of interrupt 29</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_28</name>
              <description>Priority of interrupt 28</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>Read the CPU ID Base Register to determine: the ID number of the processor core, the version number of the processor core, the implementation details of the processor core.</description>
          <addressOffset>0xED00</addressOffset>
          <resetValue>0x410CC601</resetValue>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>Implementor code: 0x41 = ARM</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Major revision number n in the rnpm revision status:\n
                0x0 = Revision 0.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHITECTURE</name>
              <description>Constant that defines the architecture of the processor:\n
                0xC = ARMv6-M architecture.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Number of processor within family: 0xC60 = Cortex-M0+</description>
              <bitRange>[15:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Minor revision number m in the rnpm revision status:\n
                0x1 = Patch 1.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
